In [1]:
import pandas as pd

# Series

In [2]:
data = [1, 2, 3, 4, 5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index = ['Linea' + str(i) for i in range(5)]

In [6]:
index

['Linea0', 'Linea1', 'Linea2', 'Linea3', 'Linea4']

In [7]:
s = pd.Series(data = data, index = index)

In [8]:
s

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
dtype: int64

In [9]:
data = {'Linea' + str(i) : i + 1 for i in range(5)}

In [10]:
data

{'Linea0': 1, 'Linea1': 2, 'Linea2': 3, 'Linea3': 4, 'Linea4': 5}

In [11]:
s = pd.Series(data)
s

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
dtype: int64

In [12]:
s1 = s + 2

In [13]:
s1

Linea0    3
Linea1    4
Linea2    5
Linea3    6
Linea4    7
dtype: int64

In [14]:
s2 = s + s1
s2

Linea0     4
Linea1     6
Linea2     8
Linea3    10
Linea4    12
dtype: int64

# DataFrame

In [15]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [16]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [17]:
df1 = pd.DataFrame(data = data)

In [18]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [19]:
index = ['Linea' + str(i) for i in range(3)]

In [20]:
index

['Linea0', 'Linea1', 'Linea2']

In [21]:
df1 = pd.DataFrame(data = data, index = index)

In [22]:
df1

        0  1  2
Linea0  1  2  3
Linea1  4  5  6
Linea2  7  8  9

In [23]:
columns = ['Columna' + str(i) for i in range(3)]
columns

['Columna0', 'Columna1', 'Columna2']

In [24]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [25]:
df1

        Columna0  Columna1  Columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [26]:
data = {'Columna0': {'Linea0': 1, 'Linea1': 4, 'Linea2': 7},
 'Columna1': {'Linea0': 2, 'Linea1': 5, 'Linea2': 8},
 'Columna2': {'Linea0': 3, 'Linea1': 6, 'Linea2': 9}}

In [27]:
data

{'Columna0': {'Linea0': 1, 'Linea1': 4, 'Linea2': 7},
 'Columna1': {'Linea0': 2, 'Linea1': 5, 'Linea2': 8},
 'Columna2': {'Linea0': 3, 'Linea1': 6, 'Linea2': 9}}

In [28]:
df2 = pd.DataFrame(data)

In [29]:
df2

        Columna0  Columna1  Columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [30]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [31]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [32]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Columna0  Columna1  Columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [33]:
df1[df1 > 0] = 'A'
df1

       Columna0 Columna1 Columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A

In [34]:
df2[df2 > 0] = 'B'
df2

       Columna0 Columna1 Columna2
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B

In [35]:
df3[df3 > 0] = 'C'
df3

       Columna0 Columna1 Columna2
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [36]:
df4 = pd.concat([df1, df2, df3])
df4

       Columna0 Columna1 Columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [37]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Columna0 Columna1 Columna2 Columna0  ... Columna2 Columna0 Columna1 Columna2
Linea0        A        A        A        B  ...        B        C        C        C
Linea1        A        A        A        B  ...        B        C        C        C
Linea2        A        A        A        B  ...        B        C        C        C

[3 rows x 9 columns]